# dataframe 생성! 

[dataframe 참고 사이트](https://nittaku.tistory.com/111)

In [21]:
import numpy as np
import pandas as pd

In [2]:
data = {"name" : [ "Kilho", "Kilho","Kilho", "Charles","Charles" ],
           "year" : [2014, 2015, 2016, 2015, 2016],
           "points" : [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame( data, columns = ["year", "names", "points", "penalty"],
                                   index = ["one", "two", "threes", "four", "five"]  )

In [3]:
df

        year names  points penalty
one     2014   NaN     1.5     NaN
two     2015   NaN     1.7     NaN
threes  2016   NaN     3.6     NaN
four    2015   NaN     2.4     NaN
five    2016   NaN     2.9     NaN

하나의 열을 가져오는 방법은 2가지이다.
DataFrame변수["칼럼명"]
2개 이상의 열을 가져오는 방법은 df[["칼럼이름1","칼럼이름2"]]

In [14]:
df["names"]

one       NaN
two       NaN
threes    NaN
four      NaN
five      NaN
Name: names, dtype: object

In [17]:
df[["year","points"]] # 대괄호가 2개이다! 명심하자!

        year  points
one     2014     1.5
two     2015     1.7
threes  2016     3.6
four    2015     2.4
five    2016     2.9

In [19]:
df["penalty"]=0.5
df

        year names  points  penalty
one     2014   NaN     1.5      0.5
two     2015   NaN     1.7      0.5
threes  2016   NaN     3.6      0.5
four    2015   NaN     2.4      0.5
five    2016   NaN     2.9      0.5

새로운 열 생성하고 동시에 대입한다.
np.arange 함수 사용 -> 칼럼을 추가하면서 대입하는 함수

In [24]:
df["zeros"]=np.arange(5)
df

        year names  points  penalty  zeros
one     2014   NaN     1.5      0.5      0
two     2015   NaN     1.7      0.5      1
threes  2016   NaN     3.6      0.5      2
four    2015   NaN     2.4      0.5      3
five    2016   NaN     2.9      0.5      4